grevaillot/svd_tools/headers/ATSAMV71N19B/usart2.h
#pragma once 

/* --- USART2: Universal Synchronous Asynchronous Receiver Transmitter  */

/** @defgroup usart2_registers Universal Synchronous Asynchronous Receiver Transmitter Register
@{*/

/** USART2_US_CR_USART_MODE Control Register **/
#define USART2_US_CR_USART_MODE			MMIO32(USART2_BASE + 0x00)
/** USART2_US_CR_SPI_MODE Control Register **/
#define USART2_US_CR_SPI_MODE			MMIO32(USART2_BASE + 0x00)
/** USART2_US_CR_LIN_MODE Control Register **/
#define USART2_US_CR_LIN_MODE			MMIO32(USART2_BASE + 0x00)
/** USART2_US_MR_USART_MODE Mode Register **/
#define USART2_US_MR_USART_MODE			MMIO32(USART2_BASE + 0x04)
/** USART2_US_MR_SPI_MODE Mode Register **/
#define USART2_US_MR_SPI_MODE			MMIO32(USART2_BASE + 0x04)
/** USART2_US_IER_USART_MODE Interrupt Enable Register **/
#define USART2_US_IER_USART_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_US_IER_USART_LIN_MODE Interrupt Enable Register **/
#define USART2_US_IER_USART_LIN_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_US_IER_SPI_MODE Interrupt Enable Register **/
#define USART2_US_IER_SPI_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_US_IER_LIN_MODE Interrupt Enable Register **/
#define USART2_US_IER_LIN_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_US_IER_LON_MODE Interrupt Enable Register **/
#define USART2_US_IER_LON_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_US_IER_LON_SPI_MODE Interrupt Enable Register **/
#define USART2_US_IER_LON_SPI_MODE			MMIO32(USART2_BASE + 0x08)
/** USART2_US_IDR_USART_MODE Interrupt Disable Register **/
#define USART2_US_IDR_USART_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_US_IDR_USART_LIN_MODE Interrupt Disable Register **/
#define USART2_US_IDR_USART_LIN_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_US_IDR_SPI_MODE Interrupt Disable Register **/
#define USART2_US_IDR_SPI_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_US_IDR_LIN_MODE Interrupt Disable Register **/
#define USART2_US_IDR_LIN_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_US_IDR_LON_MODE Interrupt Disable Register **/
#define USART2_US_IDR_LON_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_US_IDR_LON_SPI_MODE Interrupt Disable Register **/
#define USART2_US_IDR_LON_SPI_MODE			MMIO32(USART2_BASE + 0x0c)
/** USART2_US_IMR_USART_MODE Interrupt Mask Register **/
#define USART2_US_IMR_USART_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_US_IMR_USART_LIN_MODE Interrupt Mask Register **/
#define USART2_US_IMR_USART_LIN_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_US_IMR_SPI_MODE Interrupt Mask Register **/
#define USART2_US_IMR_SPI_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_US_IMR_LIN_MODE Interrupt Mask Register **/
#define USART2_US_IMR_LIN_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_US_IMR_LON_MODE Interrupt Mask Register **/
#define USART2_US_IMR_LON_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_US_IMR_LON_SPI_MODE Interrupt Mask Register **/
#define USART2_US_IMR_LON_SPI_MODE			MMIO32(USART2_BASE + 0x10)
/** USART2_US_CSR_USART_MODE Channel Status Register **/
#define USART2_US_CSR_USART_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_US_CSR_USART_LIN_MODE Channel Status Register **/
#define USART2_US_CSR_USART_LIN_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_US_CSR_SPI_MODE Channel Status Register **/
#define USART2_US_CSR_SPI_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_US_CSR_LIN_MODE Channel Status Register **/
#define USART2_US_CSR_LIN_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_US_CSR_LON_MODE Channel Status Register **/
#define USART2_US_CSR_LON_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_US_CSR_LON_SPI_MODE Channel Status Register **/
#define USART2_US_CSR_LON_SPI_MODE			MMIO32(USART2_BASE + 0x14)
/** USART2_US_RHR Receive Holding Register **/
#define USART2_US_RHR			MMIO32(USART2_BASE + 0x18)
/** USART2_US_THR Transmit Holding Register **/
#define USART2_US_THR			MMIO32(USART2_BASE + 0x1c)
/** USART2_US_BRGR Baud Rate Generator Register **/
#define USART2_US_BRGR			MMIO32(USART2_BASE + 0x20)
/** USART2_US_RTOR Receiver Timeout Register **/
#define USART2_US_RTOR			MMIO32(USART2_BASE + 0x24)
/** USART2_US_TTGR_USART_MODE Transmitter Timeguard Register **/
#define USART2_US_TTGR_USART_MODE			MMIO32(USART2_BASE + 0x28)
/** USART2_US_TTGR_LON_MODE Transmitter Timeguard Register **/
#define USART2_US_TTGR_LON_MODE			MMIO32(USART2_BASE + 0x28)
/** USART2_US_FIDI_USART_MODE FI DI Ratio Register **/
#define USART2_US_FIDI_USART_MODE			MMIO32(USART2_BASE + 0x40)
/** USART2_US_FIDI_LON_MODE FI DI Ratio Register **/
#define USART2_US_FIDI_LON_MODE			MMIO32(USART2_BASE + 0x40)
/** USART2_US_NER Number of Errors Register **/
#define USART2_US_NER			MMIO32(USART2_BASE + 0x44)
/** USART2_US_IF IrDA Filter Register **/
#define USART2_US_IF			MMIO32(USART2_BASE + 0x4c)
/** USART2_US_MAN Manchester Configuration Register **/
#define USART2_US_MAN			MMIO32(USART2_BASE + 0x50)
/** USART2_US_LINMR LIN Mode Register **/
#define USART2_US_LINMR			MMIO32(USART2_BASE + 0x54)
/** USART2_US_LINIR LIN Identifier Register **/
#define USART2_US_LINIR			MMIO32(USART2_BASE + 0x58)
/** USART2_US_LINBRR LIN Baud Rate Register **/
#define USART2_US_LINBRR			MMIO32(USART2_BASE + 0x5c)
/** USART2_US_LONMR LON Mode Register **/
#define USART2_US_LONMR			MMIO32(USART2_BASE + 0x60)
/** USART2_US_LONPR LON Preamble Register **/
#define USART2_US_LONPR			MMIO32(USART2_BASE + 0x64)
/** USART2_US_LONDL LON Data Length Register **/
#define USART2_US_LONDL			MMIO32(USART2_BASE + 0x68)
/** USART2_US_LONL2HDR LON L2HDR Register **/
#define USART2_US_LONL2HDR			MMIO32(USART2_BASE + 0x6c)
/** USART2_US_LONBL LON Backlog Register **/
#define USART2_US_LONBL			MMIO32(USART2_BASE + 0x70)
/** USART2_US_LONB1TX LON Beta1 Tx Register **/
#define USART2_US_LONB1TX			MMIO32(USART2_BASE + 0x74)
/** USART2_US_LONB1RX LON Beta1 Rx Register **/
#define USART2_US_LONB1RX			MMIO32(USART2_BASE + 0x78)
/** USART2_US_LONPRIO LON Priority Register **/
#define USART2_US_LONPRIO			MMIO32(USART2_BASE + 0x7c)
/** USART2_US_IDTTX LON IDT Tx Register **/
#define USART2_US_IDTTX			MMIO32(USART2_BASE + 0x80)
/** USART2_US_IDTRX LON IDT Rx Register **/
#define USART2_US_IDTRX			MMIO32(USART2_BASE + 0x84)
/** USART2_US_ICDIFF IC DIFF Register **/
#define USART2_US_ICDIFF			MMIO32(USART2_BASE + 0x88)
/** USART2_US_WPMR Write Protection Mode Register **/
#define USART2_US_WPMR			MMIO32(USART2_BASE + 0xe4)
/** USART2_US_WPSR Write Protection Status Register **/
#define USART2_US_WPSR			MMIO32(USART2_BASE + 0xe8)

/**@}*/


