grevaillot/svd_tools/headers/ATSAMV71N19B/usart2.h
/** @defgroup usart2_us_cr_usart_mode USCRUSARTMODE Control Register
@{*/

/** USART2_US_CR_USART_MODE_RTSDIS Request to Send Disable **/
#define USART2_US_CR_USART_MODE_RTSDIS		(1 << 19)
/** USART2_US_CR_USART_MODE_RTSEN Request to Send Enable **/
#define USART2_US_CR_USART_MODE_RTSEN		(1 << 18)
/** USART2_US_CR_USART_MODE_DTRDIS Data Terminal Ready Disable **/
#define USART2_US_CR_USART_MODE_DTRDIS		(1 << 17)
/** USART2_US_CR_USART_MODE_DTREN Data Terminal Ready Enable **/
#define USART2_US_CR_USART_MODE_DTREN		(1 << 16)
/** USART2_US_CR_USART_MODE_RETTO Start Timeout Immediately **/
#define USART2_US_CR_USART_MODE_RETTO		(1 << 15)
/** USART2_US_CR_USART_MODE_RSTNACK Reset Non Acknowledge **/
#define USART2_US_CR_USART_MODE_RSTNACK		(1 << 14)
/** USART2_US_CR_USART_MODE_RSTIT Reset Iterations **/
#define USART2_US_CR_USART_MODE_RSTIT		(1 << 13)
/** USART2_US_CR_USART_MODE_SENDA Send Address **/
#define USART2_US_CR_USART_MODE_SENDA		(1 << 12)
/** USART2_US_CR_USART_MODE_STTTO Clear TIMEOUT Flag and Start Timeout After Next Character Received **/
#define USART2_US_CR_USART_MODE_STTTO		(1 << 11)
/** USART2_US_CR_USART_MODE_STPBRK Stop Break **/
#define USART2_US_CR_USART_MODE_STPBRK		(1 << 10)
/** USART2_US_CR_USART_MODE_STTBRK Start Break **/
#define USART2_US_CR_USART_MODE_STTBRK		(1 << 9)
/** USART2_US_CR_USART_MODE_RSTSTA Reset Status Bits **/
#define USART2_US_CR_USART_MODE_RSTSTA		(1 << 8)
/** USART2_US_CR_USART_MODE_TXDIS Transmitter Disable **/
#define USART2_US_CR_USART_MODE_TXDIS		(1 << 7)
/** USART2_US_CR_USART_MODE_TXEN Transmitter Enable **/
#define USART2_US_CR_USART_MODE_TXEN		(1 << 6)
/** USART2_US_CR_USART_MODE_RXDIS Receiver Disable **/
#define USART2_US_CR_USART_MODE_RXDIS		(1 << 5)
/** USART2_US_CR_USART_MODE_RXEN Receiver Enable **/
#define USART2_US_CR_USART_MODE_RXEN		(1 << 4)
/** USART2_US_CR_USART_MODE_RSTTX Reset Transmitter **/
#define USART2_US_CR_USART_MODE_RSTTX		(1 << 3)
/** USART2_US_CR_USART_MODE_RSTRX Reset Receiver **/
#define USART2_US_CR_USART_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart2_us_cr_spi_mode USCRSPIMODE Control Register
@{*/

/** USART2_US_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART2_US_CR_SPI_MODE_RCS		(1 << 19)
/** USART2_US_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART2_US_CR_SPI_MODE_FCS		(1 << 18)
/** USART2_US_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART2_US_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART2_US_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART2_US_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART2_US_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART2_US_CR_SPI_MODE_TXEN		(1 << 6)
/** USART2_US_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART2_US_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART2_US_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART2_US_CR_SPI_MODE_RXEN		(1 << 4)
/** USART2_US_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART2_US_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART2_US_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART2_US_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart2_us_cr_lin_mode USCRLINMODE Control Register
@{*/

/** USART2_US_CR_LIN_MODE_LINWKUP Send LIN Wakeup Signal **/
#define USART2_US_CR_LIN_MODE_LINWKUP		(1 << 21)
/** USART2_US_CR_LIN_MODE_LINABT Abort LIN Transmission **/
#define USART2_US_CR_LIN_MODE_LINABT		(1 << 20)
/** USART2_US_CR_LIN_MODE_RSTSTA Reset Status Bits **/
#define USART2_US_CR_LIN_MODE_RSTSTA		(1 << 8)
/** USART2_US_CR_LIN_MODE_TXDIS Transmitter Disable **/
#define USART2_US_CR_LIN_MODE_TXDIS		(1 << 7)
/** USART2_US_CR_LIN_MODE_TXEN Transmitter Enable **/
#define USART2_US_CR_LIN_MODE_TXEN		(1 << 6)
/** USART2_US_CR_LIN_MODE_RXDIS Receiver Disable **/
#define USART2_US_CR_LIN_MODE_RXDIS		(1 << 5)
/** USART2_US_CR_LIN_MODE_RXEN Receiver Enable **/
#define USART2_US_CR_LIN_MODE_RXEN		(1 << 4)
/** USART2_US_CR_LIN_MODE_RSTTX Reset Transmitter **/
#define USART2_US_CR_LIN_MODE_RSTTX		(1 << 3)
/** USART2_US_CR_LIN_MODE_RSTRX Reset Receiver **/
#define USART2_US_CR_LIN_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart2_us_mr_usart_mode USMRUSARTMODE Mode Register
@{*/

/** USART2_US_MR_USART_MODE_ONEBIT Start Frame Delimiter Selector **/
#define USART2_US_MR_USART_MODE_ONEBIT		(1 << 31)
/** USART2_US_MR_USART_MODE_MODSYNC Manchester Synchronization Mode **/
#define USART2_US_MR_USART_MODE_MODSYNC		(1 << 30)
/** USART2_US_MR_USART_MODE_MAN Manchester Encoder/Decoder Enable **/
#define USART2_US_MR_USART_MODE_MAN		(1 << 29)
/** USART2_US_MR_USART_MODE_FILTER Receive Line Filter **/
#define USART2_US_MR_USART_MODE_FILTER		(1 << 28)

#define USART2_US_MR_USART_MODE_MAX_ITERATION_SHIFT		24
#define USART2_US_MR_USART_MODE_MAX_ITERATION_MASK		0x07
/** @defgroup usart2_us_mr_usart_mode_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART2_US_MR_USART_MODE_INVDATA Inverted Data **/
#define USART2_US_MR_USART_MODE_INVDATA		(1 << 23)
/** USART2_US_MR_USART_MODE_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART2_US_MR_USART_MODE_VAR_SYNC		(1 << 22)
/** USART2_US_MR_USART_MODE_DSNACK Disable Successive NACK **/
#define USART2_US_MR_USART_MODE_DSNACK		(1 << 21)
/** USART2_US_MR_USART_MODE_INACK Inhibit Non Acknowledge **/
#define USART2_US_MR_USART_MODE_INACK		(1 << 20)
/** USART2_US_MR_USART_MODE_OVER Oversampling Mode **/
#define USART2_US_MR_USART_MODE_OVER		(1 << 19)
/** USART2_US_MR_USART_MODE_CLKO Clock Output Select **/
#define USART2_US_MR_USART_MODE_CLKO		(1 << 18)
/** USART2_US_MR_USART_MODE_MODE9 9-bit Character Length **/
#define USART2_US_MR_USART_MODE_MODE9		(1 << 17)
/** USART2_US_MR_USART_MODE_MSBF Bit Order **/
#define USART2_US_MR_USART_MODE_MSBF		(1 << 16)

#define USART2_US_MR_USART_MODE_CHMODE_SHIFT		14
#define USART2_US_MR_USART_MODE_CHMODE_MASK		0x03
/** @defgroup usart2_us_mr_usart_mode_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART2_US_MR_USART_MODE_NBSTOP_SHIFT		12
#define USART2_US_MR_USART_MODE_NBSTOP_MASK		0x03
/** @defgroup usart2_us_mr_usart_mode_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART2_US_MR_USART_MODE_PAR_SHIFT		9
#define USART2_US_MR_USART_MODE_PAR_MASK		0x07
/** @defgroup usart2_us_mr_usart_mode_par PAR Parity Type
@{*/
/**@}*/

/** USART2_US_MR_USART_MODE_SYNC Synchronous Mode Select **/
#define USART2_US_MR_USART_MODE_SYNC		(1 << 8)

