grevaillot/svd_tools/headers/ATSAMV71N19B/usart2.h
/** @defgroup usart2_us_csr_lon_spi_mode USCSRLONSPIMODE Channel Status Register
@{*/

/** USART2_US_CSR_LON_SPI_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART2_US_CSR_LON_SPI_MODE_DCDIC		(1 << 18)
/** USART2_US_CSR_LON_SPI_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART2_US_CSR_LON_SPI_MODE_DSRIC		(1 << 17)
/** USART2_US_CSR_LON_SPI_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART2_US_CSR_LON_SPI_MODE_RIIC		(1 << 16)
/** USART2_US_CSR_LON_SPI_MODE_UNRE SPI Underrun Error **/
#define USART2_US_CSR_LON_SPI_MODE_UNRE		(1 << 10)
/** USART2_US_CSR_LON_SPI_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART2_US_CSR_LON_SPI_MODE_TXEMPTY		(1 << 9)
/** USART2_US_CSR_LON_SPI_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART2_US_CSR_LON_SPI_MODE_OVRE		(1 << 5)
/** USART2_US_CSR_LON_SPI_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART2_US_CSR_LON_SPI_MODE_TXRDY		(1 << 1)
/** USART2_US_CSR_LON_SPI_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART2_US_CSR_LON_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart2_us_rhr USRHR Receive Holding Register
@{*/

/** USART2_US_RHR_RXSYNH Received Sync **/
#define USART2_US_RHR_RXSYNH		(1 << 15)

#define USART2_US_RHR_RXCHR_SHIFT		0
#define USART2_US_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart2_us_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_thr USTHR Transmit Holding Register
@{*/

/** USART2_US_THR_TXSYNH Sync Field to be Transmitted **/
#define USART2_US_THR_TXSYNH		(1 << 15)

#define USART2_US_THR_TXCHR_SHIFT		0
#define USART2_US_THR_TXCHR_MASK		0x1ff
/** @defgroup usart2_us_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_brgr USBRGR Baud Rate Generator Register
@{*/


#define USART2_US_BRGR_FP_SHIFT		16
#define USART2_US_BRGR_FP_MASK		0x07
/** @defgroup usart2_us_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART2_US_BRGR_CD_SHIFT		0
#define USART2_US_BRGR_CD_MASK		0xffff
/** @defgroup usart2_us_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_rtor USRTOR Receiver Timeout Register
@{*/


#define USART2_US_RTOR_TO_SHIFT		0
#define USART2_US_RTOR_TO_MASK		0x1ffff
/** @defgroup usart2_us_rtor_to TO Timeout Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_ttgr_usart_mode USTTGRUSARTMODE Transmitter Timeguard Register
@{*/


#define USART2_US_TTGR_USART_MODE_TG_SHIFT		0
#define USART2_US_TTGR_USART_MODE_TG_MASK		0xff
/** @defgroup usart2_us_ttgr_usart_mode_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_ttgr_lon_mode USTTGRLONMODE Transmitter Timeguard Register
@{*/


#define USART2_US_TTGR_LON_MODE_PCYCLE_SHIFT		0
#define USART2_US_TTGR_LON_MODE_PCYCLE_MASK		0xffffff
/** @defgroup usart2_us_ttgr_lon_mode_pcycle PCYCLE LON PCYCLE Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_fidi_usart_mode USFIDIUSARTMODE FI DI Ratio Register
@{*/


#define USART2_US_FIDI_USART_MODE_FI_DI_RATIO_SHIFT		0
#define USART2_US_FIDI_USART_MODE_FI_DI_RATIO_MASK		0xffff
/** @defgroup usart2_us_fidi_usart_mode_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_fidi_lon_mode USFIDILONMODE FI DI Ratio Register
@{*/


#define USART2_US_FIDI_LON_MODE_BETA2_SHIFT		0
#define USART2_US_FIDI_LON_MODE_BETA2_MASK		0xffffff
/** @defgroup usart2_us_fidi_lon_mode_beta2 BETA2 LON BETA2 Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_ner USNER Number of Errors Register
@{*/


#define USART2_US_NER_NB_ERRORS_SHIFT		0
#define USART2_US_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart2_us_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_if USIF IrDA Filter Register
@{*/


#define USART2_US_IF_IRDA_FILTER_SHIFT		0
#define USART2_US_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart2_us_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_man USMAN Manchester Configuration Register
@{*/

/** USART2_US_MAN_RXIDLEV Receiver Idle Value **/
#define USART2_US_MAN_RXIDLEV		(1 << 31)
/** USART2_US_MAN_DRIFT Drift Compensation **/
#define USART2_US_MAN_DRIFT		(1 << 30)
/** USART2_US_MAN_ONE Must Be Set to 1 **/
#define USART2_US_MAN_ONE		(1 << 29)
/** USART2_US_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART2_US_MAN_RX_MPOL		(1 << 28)

#define USART2_US_MAN_RX_PP_SHIFT		24
#define USART2_US_MAN_RX_PP_MASK		0x03
/** @defgroup usart2_us_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART2_US_MAN_RX_PL_SHIFT		16
#define USART2_US_MAN_RX_PL_MASK		0x0f
/** @defgroup usart2_us_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART2_US_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART2_US_MAN_TX_MPOL		(1 << 12)

#define USART2_US_MAN_TX_PP_SHIFT		8
#define USART2_US_MAN_TX_PP_MASK		0x03
/** @defgroup usart2_us_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART2_US_MAN_TX_PL_SHIFT		0
#define USART2_US_MAN_TX_PL_MASK		0x0f
/** @defgroup usart2_us_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_linmr USLINMR LIN Mode Register
@{*/

/** USART2_US_LINMR_SYNCDIS Synchronization Disable **/
#define USART2_US_LINMR_SYNCDIS		(1 << 17)
/** USART2_US_LINMR_PDCM DMAC Mode **/
#define USART2_US_LINMR_PDCM		(1 << 16)

#define USART2_US_LINMR_DLC_SHIFT		8
#define USART2_US_LINMR_DLC_MASK		0xff
/** @defgroup usart2_us_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART2_US_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART2_US_LINMR_WKUPTYP		(1 << 7)
/** USART2_US_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART2_US_LINMR_FSDIS		(1 << 6)
/** USART2_US_LINMR_DLM Data Length Mode **/
#define USART2_US_LINMR_DLM		(1 << 5)
/** USART2_US_LINMR_CHKTYP Checksum Type **/
#define USART2_US_LINMR_CHKTYP		(1 << 4)
/** USART2_US_LINMR_CHKDIS Checksum Disable **/
#define USART2_US_LINMR_CHKDIS		(1 << 3)
/** USART2_US_LINMR_PARDIS Parity Disable **/
#define USART2_US_LINMR_PARDIS		(1 << 2)

