grevaillot/svd_tools/headers/ATSAMV71N19B/usart2.h
#define USART2_US_LINMR_NACT_SHIFT		0
#define USART2_US_LINMR_NACT_MASK		0x03
/** @defgroup usart2_us_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_linir USLINIR LIN Identifier Register
@{*/


#define USART2_US_LINIR_IDCHR_SHIFT		0
#define USART2_US_LINIR_IDCHR_MASK		0xff
/** @defgroup usart2_us_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_linbrr USLINBRR LIN Baud Rate Register
@{*/


#define USART2_US_LINBRR_LINFP_SHIFT		16
#define USART2_US_LINBRR_LINFP_MASK		0x07
/** @defgroup usart2_us_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART2_US_LINBRR_LINCD_SHIFT		0
#define USART2_US_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart2_us_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonmr USLONMR LON Mode Register
@{*/


#define USART2_US_LONMR_EOFS_SHIFT		16
#define USART2_US_LONMR_EOFS_MASK		0xff
/** @defgroup usart2_us_lonmr_eofs EOFS End of Frame Condition Size
@{*/
/**@}*/

/** USART2_US_LONMR_LCDS LON Collision Detection Source **/
#define USART2_US_LONMR_LCDS		(1 << 5)
/** USART2_US_LONMR_DMAM LON DMA Mode **/
#define USART2_US_LONMR_DMAM		(1 << 4)
/** USART2_US_LONMR_CDTAIL LON Collision Detection on Frame Tail **/
#define USART2_US_LONMR_CDTAIL		(1 << 3)
/** USART2_US_LONMR_TCOL Terminate Frame upon Collision Notification **/
#define USART2_US_LONMR_TCOL		(1 << 2)
/** USART2_US_LONMR_COLDET LON Collision Detection Feature **/
#define USART2_US_LONMR_COLDET		(1 << 1)
/** USART2_US_LONMR_COMMT LON comm_type Parameter Value **/
#define USART2_US_LONMR_COMMT		(1 << 0)

/**@}*/

/** @defgroup usart2_us_lonpr USLONPR LON Preamble Register
@{*/


#define USART2_US_LONPR_LONPL_SHIFT		0
#define USART2_US_LONPR_LONPL_MASK		0x3fff
/** @defgroup usart2_us_lonpr_lonpl LONPL LON Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_londl USLONDL LON Data Length Register
@{*/


#define USART2_US_LONDL_LONDL_SHIFT		0
#define USART2_US_LONDL_LONDL_MASK		0xff
/** @defgroup usart2_us_londl_londl LONDL LON Data Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonl2hdr USLONL2HDR LON L2HDR Register
@{*/

/** USART2_US_LONL2HDR_PB LON Priority Bit **/
#define USART2_US_LONL2HDR_PB		(1 << 7)
/** USART2_US_LONL2HDR_ALTP LON Alternate Path Bit **/
#define USART2_US_LONL2HDR_ALTP		(1 << 6)

#define USART2_US_LONL2HDR_BLI_SHIFT		0
#define USART2_US_LONL2HDR_BLI_MASK		0x3f
/** @defgroup usart2_us_lonl2hdr_bli BLI LON Backlog Increment
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonbl USLONBL LON Backlog Register
@{*/


#define USART2_US_LONBL_LONBL_SHIFT		0
#define USART2_US_LONBL_LONBL_MASK		0x3f
/** @defgroup usart2_us_lonbl_lonbl LONBL LON Node Backlog Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonb1tx USLONB1TX LON Beta1 Tx Register
@{*/


#define USART2_US_LONB1TX_BETA1TX_SHIFT		0
#define USART2_US_LONB1TX_BETA1TX_MASK		0xffffff
/** @defgroup usart2_us_lonb1tx_beta1tx BETA1TX LON Beta1 Length after Transmission
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonb1rx USLONB1RX LON Beta1 Rx Register
@{*/


#define USART2_US_LONB1RX_BETA1RX_SHIFT		0
#define USART2_US_LONB1RX_BETA1RX_MASK		0xffffff
/** @defgroup usart2_us_lonb1rx_beta1rx BETA1RX LON Beta1 Length after Reception
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonprio USLONPRIO LON Priority Register
@{*/


#define USART2_US_LONPRIO_NPS_SHIFT		8
#define USART2_US_LONPRIO_NPS_MASK		0x7f
/** @defgroup usart2_us_lonprio_nps NPS LON Node Priority Slot
@{*/
/**@}*/


#define USART2_US_LONPRIO_PSNB_SHIFT		0
#define USART2_US_LONPRIO_PSNB_MASK		0x7f
/** @defgroup usart2_us_lonprio_psnb PSNB LON Priority Slot Number
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_idttx USIDTTX LON IDT Tx Register
@{*/


#define USART2_US_IDTTX_IDTTX_SHIFT		0
#define USART2_US_IDTTX_IDTTX_MASK		0xffffff
/** @defgroup usart2_us_idttx_idttx IDTTX LON Indeterminate Time after Transmission (comm_type = 1 mode only)
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_idtrx USIDTRX LON IDT Rx Register
@{*/


#define USART2_US_IDTRX_IDTRX_SHIFT		0
#define USART2_US_IDTRX_IDTRX_MASK		0xffffff
/** @defgroup usart2_us_idtrx_idtrx IDTRX LON Indeterminate Time after Reception (comm_type = 1 mode only)
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_icdiff USICDIFF IC DIFF Register
@{*/


#define USART2_US_ICDIFF_ICDIFF_SHIFT		0
#define USART2_US_ICDIFF_ICDIFF_MASK		0x0f
/** @defgroup usart2_us_icdiff_icdiff ICDIFF IC Differentiator Number
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_wpmr USWPMR Write Protection Mode Register
@{*/


#define USART2_US_WPMR_WPKEY_SHIFT		8
#define USART2_US_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart2_us_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART2_US_WPMR_WPEN Write Protection Enable **/
#define USART2_US_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart2_us_wpsr USWPSR Write Protection Status Register
@{*/


#define USART2_US_WPSR_WPVSRC_SHIFT		8
#define USART2_US_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart2_us_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART2_US_WPSR_WPVS Write Protection Violation Status **/
#define USART2_US_WPSR_WPVS		(1 << 0)

/**@}*/
